# data_Preprocessing

In [18]:
import pandas as pd

In [65]:
df=pd.read_csv("ai_job_dataset.csv")

In [66]:
df.head()

,job_id,job_title,salary_usd,company_location,company_size,remote_ratio,required_skills,education_required,years_experience,posting_date,job_description_length,benefits_score
0,AI00001,AI Research Scientist,90376.0,China,M,50.0,"Tableau, PyTorch, Kubernetes, Linux, NLP",Bachelor,9.0,2024/10/18,1076.0,5.9
1,AI00002,AI Software Engineer,61895.0,Canada,M,100.0,"Deep Learning, AWS, Mathematics, Python, Docker",Master,1.0,2024/11/20,1268.0,5.2
2,AI00003,NaN,152626.0,Switzerland,L,0.0,"Kubernetes, Deep Learning, Java, Hadoop, NLP",Associate,2.0,2025/03/18,1974.0,9.4
3,AI00004,NaN,80215.0,India,M,50.0,"Scala, SQL, Linux, Python",PhD,7.0,2024/12/23,1345.0,8.6
4,AI00005,AI Consultant,54624.0,France,S,100.0,"MLOps, Java, Tableau, Python",Master,0.0,2025/04/15,1989.0,6.6

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   job_id                  37 non-null     object
 1   job_title               33 non-null     object
 2   salary_usd              27 non-null     float64
 3   company_location        39 non-null     object
 4   company_size            34 non-null     object
 5   remote_ratio            35 non-null     float64
 6   required_skills         37 non-null     object
 7   education_required      38 non-null     object
 8   years_experience        35 non-null     float64
 9   posting_date            34 non-null     object
 10  job_description_length  31 non-null     float64
 11  benefits_score          36 non-null     float64
dtypes: float64(5), object(7)
memory usage: 3.8+ KB

In [68]:
df.isnull().sum()

job_id                     2
job_title                  6
salary_usd                12
company_location           0
company_size               5
remote_ratio               4
required_skills            2
education_required         1
years_experience           4
posting_date               5
job_description_length     8
benefits_score             3
dtype: int64

In [69]:
df['salary_usd']

0      90376.0
1      61895.0
2     152626.0
3      80215.0
4      54624.0
5     123574.0
6      79670.0
7      70640.0
8          NaN
9          NaN
10         NaN
11    115047.0
12    124355.0
13     68760.0
14    150122.0
15     78846.0
16     59823.0
17    181139.0
18    155300.0
19         NaN
20         NaN
21         NaN
22         NaN
23         NaN
24         NaN
25         NaN
26         NaN
27     52997.0
28     42819.0
29     82083.0
30     67488.0
31         NaN
32    146852.0
33    178183.0
34    150864.0
35    126942.0
36     53752.0
37    111381.0
38     41430.0
Name: salary_usd, dtype: float64

In [62]:
df['salary_usd'].fillna(df['salary_usd'].mean(),inplace=True)

In [63]:
df['salary_usd']

0      90376.000000
1      61895.000000
2     152626.000000
3      80215.000000
4      54624.000000
5     123574.000000
6      79670.000000
7      70640.000000
8     100066.777778
9     100066.777778
10    100066.777778
11    115047.000000
12    124355.000000
13     68760.000000
14    150122.000000
15     78846.000000
16     59823.000000
17    181139.000000
18    155300.000000
19    100066.777778
20    100066.777778
21    100066.777778
22    100066.777778
23    100066.777778
24    100066.777778
25    100066.777778
26    100066.777778
27     52997.000000
28     42819.000000
29     82083.000000
30     67488.000000
31    100066.777778
32    146852.000000
33    178183.000000
34    150864.000000
35    126942.000000
36     53752.000000
37    111381.000000
38     41430.000000
Name: salary_usd, dtype: float64

In [79]:
df['posting_date'].fillna(df['posting_date'].mode()[0],inplace=True)

In [80]:
df['posting_date']

0     2024/10/18
1     2024/11/20
2     2025/03/18
3     2024/12/23
4     2025/04/15
5     2024/08/31
6     2024/12/29
7     2024/06/07
8     2024/01/31
9     2024/10/20
10    2025/01/29
11    2024/07/16
12    2024/12/29
13    2024/01/31
14    2024/10/02
15    2024/09/28
16    2024/01/31
17    2024/04/24
18    2024/04/30
19    2024/01/31
20    2024/06/21
21    2024/04/23
22    2024/01/31
23    2024/06/07
24    2024/10/27
25    2024/08/01
26    2024/11/18
27    2025/01/10
28    2024/10/08
29    2024/01/18
30    2024/05/16
31    2024/01/31
32    2024/08/28
33    2024/03/01
34    2024/10/26
35    2024/01/31
36    2024/10/17
37    2024/01/14
38    2024/06/15
Name: posting_date, dtype: object

In [ ]:
job_description_length

In [82]:
df['job_description_length'].fillna(df['job_description_length'].median(),inplace=True)

/var/folders/p7/yhy3_xrd6cg9c5gjkkbmgbj80000gr/T/ipykernel_75004/3140050857.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['job_description_length'].fillna(df['job_description_length'].median(),inplace=True)

In [83]:
df.isnull().sum()

job_id                    2
job_title                 6
salary_usd                0
company_location          0
company_size              5
remote_ratio              0
required_skills           2
education_required        1
years_experience          0
posting_date              0
job_description_length    0
benefits_score            3
dtype: int64

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   job_id                  37 non-null     object
 1   job_title               33 non-null     object
 2   salary_usd              39 non-null     float64
 3   company_location        39 non-null     object
 4   company_size            34 non-null     object
 5   remote_ratio            39 non-null     float64
 6   required_skills         37 non-null     object
 7   education_required      38 non-null     object
 8   years_experience        39 non-null     float64
 9   posting_date            39 non-null     object
 10  job_description_length  39 non-null     float64
 11  benefits_score          36 non-null     float64
dtypes: float64(5), object(7)
memory usage: 3.8+ KB

In [85]:
df.dropna(axis=1, inplace=True)

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39 entries, 0 to 38
Data columns (total 6 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   salary_usd              39 non-null     float64
 1   company_location        39 non-null     object
 2   remote_ratio            39 non-null     float64
 3   years_experience        39 non-null     float64
 4   posting_date            39 non-null     object
 5   job_description_length  39 non-null     float64
dtypes: float64(4), object(2)
memory usage: 2.0+ KB

In [87]:
df.head()

,salary_usd,company_location,remote_ratio,years_experience,posting_date,job_description_length
0,90376.0,China,50.0,9.0,2024/10/18,1076.0
1,61895.0,Canada,100.0,1.0,2024/11/20,1268.0
2,152626.0,Switzerland,0.0,2.0,2025/03/18,1974.0
3,80215.0,India,50.0,7.0,2024/12/23,1345.0
4,54624.0,France,100.0,0.0,2025/04/15,1989.0

In [88]:
df.isnull().sum()

salary_usd                0
company_location          0
remote_ratio              0
years_experience          0
posting_date              0
job_description_length    0
dtype: int64